In [1]:
import pandas as pd

print('Done')

Done

In [2]:
df = pd.read_excel('../../data/original_datasets/ValleyFeverDashboard_Data.xlsx')
df.head()

,"Valley Fever Cases and Incidence Rates by Local Health Jurisdiction, California, 2001-2022",Unnamed: 1,Unnamed: 2,Unnamed: 3
0,Local Health Jurisdiction,Year of Estimated Illness Onset,Cases,Rate
1,ALAMEDA,2001,7,0.5*
2,ALAMEDA,2002,2,0.1*
3,ALAMEDA,2003,9,0.7*
4,ALAMEDA,2004,12,0.9*

# there is an issue wit the original document where they inclued the title as a top row so i will remove that

In [3]:
print(df.columns)

Index(['Valley Fever Cases and Incidence Rates by Local Health Jurisdiction, California, 2001-2022 ',
       'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3'],
      dtype='object')

In [4]:
df = df.rename(columns={
    'Valley Fever Cases and Incidence Rates by Local Health Jurisdiction, California, 2001-2022 ' : 'County',
    'Unnamed: 1' : 'Year',
    'Unnamed: 2' : 'Cases', 
    'Unnamed: 3' : 'Rate'
})
df.head()

                      County                             Year  Cases  Rate
0  Local Health Jurisdiction  Year of Estimated Illness Onset  Cases  Rate
1                    ALAMEDA                             2001      7  0.5*
2                    ALAMEDA                             2002      2  0.1*
3                    ALAMEDA                             2003      9  0.7*
4                    ALAMEDA                             2004     12  0.9*

In [5]:
# the first row is redundand so i am dropping it 
df.drop(index=df.index[0], axis=0, inplace=True)
df.head()

    County  Year Cases  Rate
1  ALAMEDA  2001     7  0.5*
2  ALAMEDA  2002     2  0.1*
3  ALAMEDA  2003     9  0.7*
4  ALAMEDA  2004    12  0.9*
5  ALAMEDA  2005    11  0.8*

In [6]:
df.tail()

                                                 County  Year Cases  Rate
1405                                               YUBA  2019     5  6.2*
1406                                               YUBA  2020     2  2.4*
1407                                               YUBA  2021     2  2.4*
1408                                               YUBA  2022     2  2.4*
1409  *Potentially unreliable rate: relative standar...   NaN   NaN   NaN

In [7]:
#the bottom row is off too so i am dropping it 
df.drop(index=df.index[-1], axis=0, inplace=True)
df.tail()

     County  Year Cases  Rate
1404   YUBA  2018     2  2.5*
1405   YUBA  2019     5  6.2*
1406   YUBA  2020     2  2.4*
1407   YUBA  2021     2  2.4*
1408   YUBA  2022     2  2.4*

In [8]:
#i suscpect the rate dtype is an object instead of a float
print(df.dtypes)

County    object
Year      object
Cases     object
Rate      object
dtype: object

In [9]:
#int looks like they all are so i am going to fix it so that the year, cases and rate columns are made into int and floats

#change to ints
df[['Year', 'Cases']] = df[['Year', 'Cases']].astype(int)

# remove all the asterisks frm the number and change to float
df['Rate'] = df['Rate'].str.replace('*', '')
df['Rate'] = pd.to_numeric(df['Rate'], errors='coerce')

print(df.dtypes)
df.head()

County     object
Year        int64
Cases       int64
Rate      float64
dtype: object

    County  Year  Cases  Rate
1  ALAMEDA  2001      7   0.5
2  ALAMEDA  2002      2   0.1
3  ALAMEDA  2003      9   0.7
4  ALAMEDA  2004     12   0.9
5  ALAMEDA  2005     11   0.8

In [11]:
df.to_csv('../../data/valley_fever_rates/valley_fever_rates_05_30_24.csv', index=False)